src/DataProcessors/ВызовВебСервисаPOST/ВызовВебСервисаPOST.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВызовВебСервисаPOST</name>
</mdclass:DataProcessor>

src/Catalogs/НастройкиSOAP/НастройкиSOAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиSOAP</name>
  <predefined>
    <items>
      <name>Основная</name>
      <description>Основная</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ВызовВебСервисаPOST/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Отправить(Команда)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Текст) Тогда
		Сообщить("Текст запроса не определен!");
		Возврат;
	КонецЕсли;	
	//ЭтаФорма.ОтветВебСервиса = ПроверитьОрфографию(ЭтаФорма.Текст);
	ЭтаФорма.ОтветВебСервиса = ОбменДаннымиСервер.ВернутьSOAPОтвет(ЭтаФорма.Текст);
	
	
КонецПроцедуры

// Функция осуществляет вызов веб-сервиса проверки правописания POST-запросом.
//
// Параметры
//  ПроверяемыйТекст  - Строка - текст для проверки правописания.
//
// Возвращаемое значение:
//   Строка   - ответ веб-сервиса в формате XML.
//
&НаСервереБезКонтекста
Функция ПроверитьОрфографию(ПроверяемыйТекст)
	 Сервер = Справочники.НастройкиSOAP.Основная.АдресСервера;
	 Пользов = Справочники.НастройкиSOAP.Основная.СистемныйПользователь;
	 Пароль = Справочники.НастройкиSOAP.Основная.СистемныйПароль;
	 Если ЗначениеЗаполнено(Сервер) И 
		  ЗначениеЗаполнено(Пользов) И
		  ЗначениеЗаполнено(Пароль) Тогда
	
	 	Заголовки = Новый Соответствие;
	 	Заголовки.Вставить("Content-Type",	"text/xml;charset=UTF-8");
	 	Заголовки.Вставить("SOAPAction",	"http://" + Сервер);
	 
	 	HTTPЗапрос = Новый HTTPЗапрос("", Заголовки);
	 	HTTPЗапрос.УстановитьТелоИзСтроки(СформироватьСообщениеSOAP(ПроверяемыйТекст), "UTF-8");
	 	HTTPСоединение = Новый HTTPСоединение(Пользов+":"+Пароль+"@"+Сервер); 
	 	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	 
	 	Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
		
	Возврат "Веб сервис не настроен";
	
 КонецФункции // ПроверитьОрфографию()
 
// Функция формирует SOAP-сообщения для операции checkText.
//
// Параметры
//  Текст  - Строка - текст для проверки орфографии.
//
// Возвращаемое значение:
//   строка   - SOAP-сообщение в формате XML.
//
&НаСервереБезКонтекста
Функция СформироватьСообщениеSOAP(Текст)
	Шаблон = 
   "<soapenv:Envelope 
    |xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" 
	|xmlns:oraw=""http://xmlns.oracle.com/orawsv"">
	|<soapenv:Header/>
	|   <soapenv:Body>
	|   <oraw:query>
	|         <oraw:query_text type=""SQL"">
	|      <![CDATA[" + Текст + "]]>
	|      </oraw:query_text>
	|	   <oraw:pretty_print>true</oraw:pretty_print>
	|      </oraw:query>
	|   </soapenv:Body>
	|</soapenv:Envelope>";
	
	//МестоположениеWSDL = "http://speller.yandex.net/services/spellservice?WSDL";
	//WSОпределения = Новый WSОпределения(МестоположениеWSDL);
	//
	//ПространствоИменSpeller = "http://speller.yandex.net/services/spellservice";
	//ПакетСпеллер = WSОпределения.ФабрикаXDTO.Пакеты.Получить(ПространствоИменSpeller);
	//СвойствоXDTO = ПакетСпеллер.КорневыеСвойства.Получить("CheckTextRequest");
	//
	//checkText = WSОпределения.ФабрикаXDTO.Создать(СвойствоXDTO.Тип);
	//checkText.Text = Текст;
	//checkText.lang = "ru";
	//
	//ПространствоИменSOAP = "http://schemas.xmlsoap.org/soap/envelope/";
	//
	//ЗаписьXML = Новый ЗаписьXML;
	//ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8");
	//ЗаписьXML.УстановитьСтроку(ПараметрыЗаписиXML);
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Envelope", ПространствоИменSOAP);
	//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("soap", ПространствоИменSOAP);
	//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Body", ПространствоИменSOAP);
	//	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("spel", ПространствоИменSpeller);
	//		WSОпределения.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, checkText, СвойствоXDTO.ЛокальноеИмя, СвойствоXDTO.URIПространстваИмен);
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Возврат ЗаписьXML.Закрыть();
	Возврат Шаблон;

КонецФункции // СформироватьСообщениеSOAP()
